       IDENTIFICATION DIVISION.
       PROGRAM-ID. CODEABBEY-SET-1.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-LINE PIC X(80).
       01  WS-NUM1 BINARY-LONG.
       01  WS-NUM2 BINARY-LONG.
       01  WS-SUM  PIC Z(9)9.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           ACCEPT WS-LINE.
           UNSTRING WS-LINE DELIMITED BY SPACE INTO WS-NUM1 WS-NUM2.
           ADD WS-NUM1 TO WS-NUM2 GIVING WS-SUM.
           DISPLAY WS-SUM.
           STOP RUN.
       END PROGRAM CODEABBEY-SET-1.
